
&НаКлиенте
Асинх Процедура КомандаПодбор(Команда)
	
	ОбещаниеВыбора = ВыбратьИзСпискаАсинх(СписокВариантовПодбора, Элементы.СписокЗначенийАргумента);
	Результат = Ждать ОбещаниеВыбора;
	Если Результат <> Неопределено Тогда
		ОповеститьОВыборе(Результат.Значение);
	КонецЕсли;	

КонецПроцедуры

// @strict-types


#Область ОписаниеПеременных



#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗначенийАргумента = Параметры.СписокЗначенийАргумента;
	СписокВариантовПодбора = Параметры.СписокВариантовПодбора;

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ОповеститьОВыборе(СписокЗначенийАргумента);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
