

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокЗначенийАргумента = Параметры.СписокЗначенийАргумента;
	СписокВариантовПодбора = Параметры.СписокВариантовПодбора;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ОповеститьОВыборе(СписокЗначенийАргумента);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();

КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаПодбор(Команда)
	
	ОбещаниеВыбора = ВыбратьИзСпискаАсинх(СписокВариантовПодбора, Элементы.СписокЗначенийАргумента);
	Результат = Ждать ОбещаниеВыбора;
	Если Результат <> Неопределено Тогда
		ОповеститьОВыборе(Результат.Значение);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти